app/controllers/messages_controller.rb

  def create
    # day 1
    #Message.create message_params
    #redirect_to messages_url # use _url because http spec says redirect has to include full url. use root_path in views

    #day 2

    # @message = Message.create(message_params) # removed to allow us to associate message to current devise user
    @message = current_user.messages.create(message_params)
---
INSERT INTO "messages" ("body", "created_at", "receiver_id", "sender_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Test"], ["created_at", Sun, 19 Jan 2014 15:54:52 UTC +00:00], ["receiver_id", 119], ["sender_id", 119], ["updated_at", Sun, 19 Jan 2014 15:54:52 UTC +00:00]]