app/controllers/user_messages_controller.rb

INSERT INTO "messages" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "Test"], ["created_at", Sat, 18 Jan 2014 15:41:01 UTC +00:00], ["updated_at", Sat, 18 Jan 2014 15:41:01 UTC +00:00]]
---
  def create

    Message.create message_params